<a href="https://colab.research.google.com/github/GuisoPiu/Basic-Tetris-game/blob/master/DataScience.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np

In [ ]:
import pandas as pd

In [ ]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])

In [ ]:
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [ ]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [11]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
columns=list('AB'))

NameError: ignored

In [12]:
rng = np.random.RandomState(42)

In [13]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
columns=list('AB'))

In [14]:
A

    A   B
0   6  19
1  14  10

In [15]:
B = pd.DataFrame(rng.randint(0, 10, (3,)),columns=list('BAC'))

ValueError: ignored

In [16]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
columns=list('BAC'))

In [17]:
B

   B  A  C
0  9  2  6
1  7  4  3
2  7  7  2

In [18]:
A

    A   B
0   6  19
1  14  10

In [20]:
A + B

      A     B   C
0   8.0  28.0 NaN
1  18.0  17.0 NaN
2   NaN   NaN NaN

In [21]:
A

    A   B
0   6  19
1  14  10

In [22]:
fill = A.stack()

In [23]:
fill

0  A     6
   B    19
1  A    14
   B    10
dtype: int64

In [24]:
fill = A.stack().mean()

In [25]:
fill

12.25

In [26]:
A.add(B, fill_value=fill)

       A      B      C
0   8.00  28.00  18.25
1  18.00  17.00  15.25
2  19.25  19.25  14.25

In [27]:
A.add(B, fill_value=0)

      A     B    C
0   8.0  28.0  6.0
1  18.0  17.0  3.0
2   7.0   7.0  2.0

In [28]:
A

    A   B
0   6  19
1  14  10

In [29]:
B

   B  A  C
0  9  2  6
1  7  4  3
2  7  7  2

In [30]:
A = rng.randint(10, size=(3,4))

In [31]:
A

array([[5, 4, 1, 7],
       [5, 1, 4, 0],
       [9, 5, 8, 0]])

In [32]:
df = pd.DataFrame(A, columns=list('QRST'))

In [33]:
df

   Q  R  S  T
0  5  4  1  7
1  5  1  4  0
2  9  5  8  0

In [34]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  1  0 -3  3
1  4  0  3 -1
2  4  0  3 -5

In [35]:
df

   Q  R  S  T
0  5  4  1  7
1  5  1  4  0
2  9  5  8  0

In [36]:
halfrow = df.iloc[0, ::2]

In [37]:
halfrow

Q    5
S    1
Name: 0, dtype: int64

In [38]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1  0.0 NaN  3.0 NaN
2  4.0 NaN  7.0 NaN

In [39]:
data = pd.Series([1, np.nan, 'hello', None])

In [40]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [41]:
data[data.isnull()]

1     NaN
3    None
dtype: object

In [42]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [43]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [44]:
data.dropna()

0        1
2    hello
dtype: object

In [45]:
df = pd.DataFrame([[1, np.nan, 2],
[2, 3, 5],
[np.nan, 4, 6]])

In [46]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [47]:
df.dtypes()

TypeError: ignored

In [48]:
df.dtypes

0    float64
1    float64
2      int64
dtype: object

In [49]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [50]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [51]:
df.drop()

ValueError: ignored

In [52]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [53]:
df.dropna(axis='colums')

ValueError: ignored

In [54]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [55]:
df.dropna(axis=0)

     0    1  2
1  2.0  3.0  5

In [56]:
df.dropna(axis=1)

   2
0  2
1  5
2  6

In [57]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [58]:
df[3] = np.nan

In [59]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [60]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [61]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [62]:
df.dropna(axis='rows', thresh=2)

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [63]:
df.dropna(axis='rows', thresh=1)

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [64]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [65]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))

In [66]:
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [67]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [68]:
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [69]:
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64